<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 支援的社交平台
    |--------------------------------------------------------------------------
    |
    | 此配置定義了應用程式支援的社交平台。
    | 預設情況下，LINE 是唯一支援的平台。
    | 若要添加其他平台，請在此添加並確保已正確配置相應的 Socialite 提供者。
    |
    */
    'providers' => ['line'],

    /*
    |--------------------------------------------------------------------------
    | 路由前綴
    |--------------------------------------------------------------------------
    |
    | 此配置定義了 Socialite 路由的前綴。
    | 預設為 'auth'，生成的路由將是 'auth/redirect' 和 'auth/callback'。
    |
    */
    'route_prefix' => 'auth',

    /*
    |--------------------------------------------------------------------------
    | 路由名稱前綴
    |--------------------------------------------------------------------------
    |
    | 此配置定義了路由名稱的前綴。
    | 預設為 'auth'，生成的路由名稱將是 'auth.redirect' 和 'auth.callback'。
    |
    */
    'route_name_prefix' => 'auth',
]; 